In [1]:
import pandas as pd

/tmp/ipykernel_13941/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [74]:
DF1 = pd.DataFrame({'NOMBRE': ['Jose', 'Max'],
                    'CARRERA': ['Economia', 'Arquitectura'],
                    'EDAD': [23,26]})

In [75]:
DF2 = pd.DataFrame({'NOMBRE': ['Aurora', 'Maria'], 
                    'CARRERA': ['Medicina', 'Informatica'],
                    'EDAD': [22,28],
                    'SEXO': ['F', 'F']})

In [76]:
DF = pd.concat([DF1,DF2])

In [77]:
DF1

  NOMBRE       CARRERA  EDAD
0   Jose      Economia    23
1    Max  Arquitectura    26

In [78]:
DF2

   NOMBRE      CARRERA  EDAD SEXO
0  Aurora     Medicina    22    F
1   Maria  Informatica    28    F

In [80]:
DF

   NOMBRE       CARRERA  EDAD SEXO
0    Jose      Economia    23  NaN
1     Max  Arquitectura    26  NaN
0  Aurora      Medicina    22    F
1   Maria   Informatica    28    F

In [79]:
DF.reset_index(drop=True)

   NOMBRE       CARRERA  EDAD SEXO
0    Jose      Economia    23  NaN
1     Max  Arquitectura    26  NaN
2  Aurora      Medicina    22    F
3   Maria   Informatica    28    F

In [62]:
df1 = pd.DataFrame({'AUTOS': ['Nissan', 'Ford', 'Audi'],
                    'COLOR': ['Blanco', 'Azul', 'Rojo']}).set_index('AUTOS')

In [63]:
df2 = pd.DataFrame({'AUTOS': ['Nissan', 'Ford', 'Audi'],
                    'MODELO': [2018, 2020, 2022]}).set_index('AUTOS')

In [64]:
df1

         COLOR
AUTOS
Nissan  Blanco
Ford      Azul
Audi      Rojo

In [65]:
df2

        MODELO
AUTOS
Nissan    2018
Ford      2020
Audi      2022

In [66]:
df = pd.concat([df1,df2], axis=1)

In [67]:
df

         COLOR  MODELO
AUTOS
Nissan  Blanco    2018
Ford      Azul    2020
Audi      Rojo    2022

In [6]:
DF1M = pd.DataFrame({'AUTOS': ['Nissan', 'Ford', 'Audi'],
                    'COLOR': ['Blanco', 'Azul', 'Rojo']}).set_index('AUTOS')

In [7]:
DF2M = pd.DataFrame({'AUTOS': ['Toyota', 'Ford', 'Audi'],
                    'MODELO': [2018, 2020, 2022]}).set_index('AUTOS')

In [12]:
##Solo Columnas() inner
DFM = pd.merge(DF1M, DF2M, on='AUTOS')

In [14]:
##Filas
DFM = pd.merge(DF1M, DF2M, on='AUTOS', how='outer')

In [20]:
##Tomar primer dataframe como referencia
DFM = pd.merge(DF1M, DF2M, on='AUTOS', how='left')

In [18]:
##Tomar segundo dataframe como referencia
DFM = pd.merge(DF1M, DF2M, on='AUTOS', how='right')

In [21]:
DFM

         COLOR  MODELO
AUTOS
Nissan  Blanco     NaN
Ford      Azul  2020.0
Audi      Rojo  2022.0